#include <stdio.h>
//表达式求值
int main()
{
//整形提升这个概念，例如一个int是4字节32位，但是一个char只是一个字节，8位，取后8位，在计算的时候，补到32位，结果再取后8位
    char a = 126;
    char b = 5;
    char c = a + b;
    printf("%d",c);
    return 0;
    //5  00000000 00000000 00000000 00000101 ... a = 00000101
    //12600000000 00000000 00000000 01111110 ... b = 01111110
    //a + b = 00000000 00000000 00000000 10000011
    //c = 10000011  打印的时候就是 11111111 11111111 11111111 10000011补码
    //原码：100000000 00000000 00000000 01111101 = -125

//有点意思，听说计算机组成网络会有



}